mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/mb9bf56xr.svd
        <!-- REGISTER "SACMDEST" -->
        <register>
          <name>SACMDEST</name>
          <description>Auto CMD Error Status Register [BHW]</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x009F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMDND12ERR" -->
            <field>
              <name>CMDND12ERR</name>
              <description>Command Not Issued by Auto CMD12 Error</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMDIDXERR" -->
            <field>
              <name>ACMDIDXERR</name>
              <description>Auto CMD Index Error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMDEBERR" -->
            <field>
              <name>ACMDEBERR</name>
              <description>Auto CMD End Bit Error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMDCRCERR" -->
            <field>
              <name>ACMDCRCERR</name>
              <description>Auto CMD CRC Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMDTOERR" -->
            <field>
              <name>ACMDTOERR</name>
              <description>Auto CMD Timeout Error</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACMD12NOEX" -->
            <field>
              <name>ACMD12NOEX</name>
              <description>Auto CMD12 not executed</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SHCTL2" -->
        <register>
          <name>SHCTL2</name>
          <description>Host Control 2 Register [BHW]</description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xC0FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PREVALEN" -->
            <field>
              <name>PREVALEN</name>
              <description>Preset Value Enable</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ASYINTEN" -->
            <field>
              <name>ASYINTEN</name>
              <description>Asynchronous Interrupt Enable</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SMPCLKSEL" -->
            <field>
              <name>SMPCLKSEL</name>
              <description>Sampling Clock Select</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DOTUING" -->
            <field>
              <name>DOTUING</name>
              <description>Execute Tuning</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRVSEL" -->
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "V18SGNEN" -->
            <field>
              <name>V18SGNEN</name>
              <description>1.8V Signaling Enable</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UHSMDSEL" -->
            <field>
              <name>UHSMDSEL</name>
              <description>UHS Mode Select</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAPBLTY0" -->
        <register>
          <name>CAPBLTY0</name>
          <description>Capabilities Register 0 [BHW]</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFB00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDBASECLK" -->
            <field>
              <name>SDBASECLK</name>
              <description>Base Clock Frequency For SD Clock</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TOCLKUNIT" -->
            <field>
              <name>TOCLKUNIT</name>
              <description>Timeout Clock Unit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TOCLKFREQ" -->
            <field>
              <name>TOCLKFREQ</name>
              <description>Timeout Clock Frequency</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAPBLTY1" -->
        <register>
          <name>CAPBLTY1</name>
          <description>Capabilities Register 1 [BHW]</description>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xF7EF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STOPTYPE" -->
            <field>
              <name>STOPTYPE</name>
              <description>Slot Type</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ASYINTSPT" -->
            <field>
              <name>ASYINTSPT</name>
              <description>Asynchronous Interrupt Support</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BUS64SPT" -->
            <field>
              <name>BUS64SPT</name>
              <description>64-bit System Bus Support</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "V18SPT" -->
            <field>
              <name>V18SPT</name>
              <description>Voltage Support 1.8V</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "V30SPT" -->
            <field>
              <name>V30SPT</name>
              <description>Voltage Support 3.0V</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "V33SPT" -->
            <field>
              <name>V33SPT</name>
              <description>Voltage Support 3.3V</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LWPWRSPT" -->
            <field>
              <name>LWPWRSPT</name>
              <description>Suspend/Resume Suppoort</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDMASPT" -->
            <field>
              <name>SDMASPT</name>
              <description>SDMA Support</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HGHSPDSPT" -->
            <field>
              <name>HGHSPDSPT</name>
              <description>High Speed Support</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADMA2SPT" -->
            <field>
              <name>ADMA2SPT</name>
              <description>ADMA2 Support</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EMBD8BIT" -->
            <field>
              <name>EMBD8BIT</name>
              <description>8-bit Support for Embedded Device</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MAXBLCKLEN" -->
            <field>
              <name>MAXBLCKLEN</name>
              <description>Max Block Length</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CAPBLTY2" -->
        <register>
          <name>CAPBLTY2</name>
          <description>Capabilities Register 2 [BHW]</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xEF77</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RETNMODE" -->
            <field>
              <name>RETNMODE</name>
              <description>Re-Tuning Modes</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USETNSDR50" -->
            <field>
              <name>USETNSDR50</name>
              <description>Use Tuning for SDR50</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMCNTRETN" -->
            <field>
              <name>TMCNTRETN</name>
              <description>Timer Count for Re-Tuning</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRVTPDSPT" -->
            <field>
              <name>DRVTPDSPT</name>
              <description>Driver Type D Support</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRVTPCSPT" -->
            <field>
              <name>DRVTPCSPT</name>
              <description>Driver Type C Support</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DRVTPASPT" -->
            <field>
              <name>DRVTPASPT</name>
              <description>Driver Type A Support</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DDR50SPT" -->
            <field>
              <name>DDR50SPT</name>
              <description>DDR50 Support</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDR104SPT" -->
            <field>
              <name>SDR104SPT</name>
              <description>SDR104 Support</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDR50SPT" -->
            <field>
              <name>SDR50SPT</name>
              <description>SDR50 Support</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
