mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf56xr/mb9bf56xr.svd
        <!-- REGISTER "CAPBLTY3" -->
        <register>
          <name>CAPBLTY3</name>
          <description>Capabilities Register 3 [BHW]</description>
          <addressOffset>0x46</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLKMULTPL" -->
            <field>
              <name>CLKMULTPL</name>
              <description>Clock Multiplier</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MXCCAPY0" -->
        <register>
          <name>MXCCAPY0</name>
          <description>Maximum Current Capabilities Register 0 [BHW]</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "V30MAXCUR" -->
            <field>
              <name>V30MAXCUR</name>
              <description>Maximum Current for 3.0V</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "V33MAXCUR" -->
            <field>
              <name>V33MAXCUR</name>
              <description>Maximum Current for 3.3V</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MXCCAPY1" -->
        <register>
          <name>MXCCAPY1</name>
          <description>Maximum Current Capabilities Register 1 [BHW]</description>
          <addressOffset>0x4A</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "V18MAXCUR" -->
            <field>
              <name>V18MAXCUR</name>
              <description>Maximum Current for 1.8V</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MXCCAPY2" -->
        <register>
          <name>MXCCAPY2</name>
          <description>Maximum Current Capabilities Register 2 [BHW]</description>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "MXCCAPY3" -->
        <register>
          <name>MXCCAPY3</name>
          <description>Maximum Current Capabilities Register 3 [BHW]</description>
          <addressOffset>0x4E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "FEACEST" -->
        <register>
          <name>FEACEST</name>
          <description>Force Event Register for Auto CMD Error Status [BHW]</description>
          <addressOffset>0x50</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x009F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FEVNTCMD12" -->
            <field>
              <name>FEVNTCMD12</name>
              <description>Force Event for Command Not Issued by Auto CMD12 Error</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEVNTIDX" -->
            <field>
              <name>FEVNTIDX</name>
              <description>Force Event for Auto CMD Index Error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEVNTEB" -->
            <field>
              <name>FEVNTEB</name>
              <description>Force Event for Auto CMD End Bit Error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEVNTCRC" -->
            <field>
              <name>FEVNTCRC</name>
              <description>Force Event for Auto CMD CRC Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEVNTTO" -->
            <field>
              <name>FEVNTTO</name>
              <description>Force Event for Auto CMD Timeout Error</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEVNT12ND" -->
            <field>
              <name>FEVNT12ND</name>
              <description>Force Event for Auto CMD12 not executed</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SFEEIST" -->
        <register>
          <name>SFEEIST</name>
          <description>Force Event Register for Error Interrupt Status [BHW]</description>
          <addressOffset>0x52</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FEAHBMSERR" -->
            <field>
              <name>FEAHBMSERR</name>
              <description>Force Event for AHB Master Error</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEA19ERR" -->
            <field>
              <name>FEA19ERR</name>
              <description>Force Event for Auto CMD19 Error</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEACKERR" -->
            <field>
              <name>FEACKERR</name>
              <description>Force Event for Boot Acknowledge Error</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FETUNEERR" -->
            <field>
              <name>FETUNEERR</name>
              <description>Force Event for Tuning Error</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEADMAERR" -->
            <field>
              <name>FEADMAERR</name>
              <description>Force Event for ADMA Error</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEA12ERR" -->
            <field>
              <name>FEA12ERR</name>
              <description>Force Event for Auto CMD12 Error</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FECRLTERR" -->
            <field>
              <name>FECRLTERR</name>
              <description>Force Event for Current limit Error</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEDTEBERR" -->
            <field>
              <name>FEDTEBERR</name>
              <description>Force Event for Data End Bit Error</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEDTCRCERR" -->
            <field>
              <name>FEDTCRCERR</name>
              <description>Force Event for Data CRC Error</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEDTOTERR" -->
            <field>
              <name>FEDTOTERR</name>
              <description>Force Event for Data Timeout Error</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEIDXERR" -->
            <field>
              <name>FEIDXERR</name>
              <description>Force Event for Command Index Error</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FEEBERR" -->
            <field>
              <name>FEEBERR</name>
              <description>Force Event for Command End Bit Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FECRCERR" -->
            <field>
              <name>FECRCERR</name>
              <description>Force Event for Command CRC Error</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "FETOERR" -->
            <field>
              <name>FETOERR</name>
              <description>Force Event for Command Timeout Error</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADMAEST" -->
        <register>
          <name>ADMAEST</name>
          <description>ADMA Error Status Register [BHW]</description>
          <addressOffset>0x54</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADMALENME" -->
            <field>
              <name>ADMALENME</name>
              <description>ADMA Length Mismatch Error</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADMAERRS" -->
            <field>
              <name>ADMAERRS</name>
              <description>ADMA Error Status</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
